openfoam9/tutorials/multiphase/interFoam/laminar/damBreakWithObstacle/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 5e-07;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
    }
    walls
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.0001;
        Cs              uniform 0.5;
        value           uniform 5e-07;
    }
}


// ************************************************************************* //
