openfoam9/tutorials/multiphase/interFoam/laminar/damBreakWithObstacle/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication topoSet
runApplication subsetMesh -overwrite c0 -patch walls -noFields
runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
